package ru.student;

public class App {
    public static void main(String[] args) {
        // Вычислить n-ое треугольного число(сумма чисел от 1 до n),
        // n! (произведение чисел от 1 до n)
        Task1.runTask();

        // Вывести все простые числа от 1 до 1000
        // Task2.runTask();

        // Реализовать простой калькулятор
        // Task3.runTask();

        // *+Задано уравнение вида q + w = e, q, w, e >= 0.
        // Некоторые цифры могут быть заменены знаком вопроса, например 2? + ?5 = 69.
        // Требуется восстановить выражение до верного равенства.
        // Предложить хотя бы одно решение или сообщить, что его нет.

    }

}
